## Target Guided Ordinal Encoding

This method is used to encode categorical variables based on their relationship with target variable, itis useful when we have large number of unique categories, and we want to use the data for machine learning.

In this method we replace each category in categorical variable with numerical value based on the mean or median of the target variable of the category, this creates a monotonic relationship between catgorical variable and target variable, which improves prdictive power of the model.

In [4]:
import pandas as pd

In [6]:
df=pd.DataFrame({'city':['newyork', 'london', 'paris', 'tokyo', 'newyork', 'paris'],
                'price':[200,150,300,250,180,320]})

In [8]:
df

      city  price
0  newyork    200
1   london    150
2    paris    300
3    tokyo    250
4  newyork    180
5    paris    320

In [16]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [18]:
df['city_encoded']=df['city'].map(mean_price)

In [20]:
df

      city  price  city_encoded
0  newyork    200         190.0
1   london    150         150.0
2    paris    300         310.0
3    tokyo    250         250.0
4  newyork    180         190.0
5    paris    320         310.0

In [24]:
df[['price', 'city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0

In [26]:
import seaborn as sns
df=sns.load_dataset('tips')

In [28]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [30]:
df['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [36]:
mean_bill=df.groupby('time')['total_bill'].mean().to_dict()

C:\Users\vidushi\AppData\Local\Temp\ipykernel_1152\3401611641.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_bill=df.groupby('time')['total_bill'].mean().to_dict()

In [38]:
mean_bill

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [40]:
df['time_encoded']=df['time'].map(mean_bill)

In [ ]:
df.head()